<?php

return [

    /*
    |--------------------------------------------------------------------------
    | 应用程序名称
    |--------------------------------------------------------------------------
    |
    | 此值是应用程序的名称，当框架需要在通知或其他需要显示应用程序名称的 UI 元素中
    | 显示应用程序名称时，将使用该值。
    ｜
    */

    'name' => env('APP_NAME', 'Laravel'),

    /*
    |--------------------------------------------------------------------------
    | 应用程序环境
    |--------------------------------------------------------------------------
    |
    | 此值确定应用程序当前运行的“环境”。这可能会决定您希望如何配置应用程序使用的各种服务。
    | 请在 ".env" 文件中设置此值。
    |
    */

    'env' => env('APP_ENV', 'production'),

    /*
    |--------------------------------------------------------------------------
    | 应用程序调试模式
    |--------------------------------------------------------------------------
    |
    | 当应用程序处于调试模式时，应用程序中发生的每个错误都会显示带有堆栈跟踪的详细错误消息。
    | 如果禁用，将显示一个简单的通用错误页面。
    |
    */

    'debug' => (bool) env('APP_DEBUG', false),

    /*
    |--------------------------------------------------------------------------
    | 应用程序 URL
    |--------------------------------------------------------------------------
    |
    | 控制台在使用 Artisan 命令行工具时使用此 URL 正确生成 URL。您应该将其设置为应用程序的根目录，
    | 以便在 Artisan 命令中使用。
    |
    */

    'url' => env('APP_URL', 'http://localhost'),

    /*
    |--------------------------------------------------------------------------
    | 应用程序时区
    |--------------------------------------------------------------------------
    |
    | 您可以在此处指定应用程序的默认时区，PHP 的日期和日期时间函数将使用该时区。
    | 默认情况下，时区设置为 "UTC"，因为它适用于大多数用例。
    |
    */

    'timezone' => 'UTC',

    /*
    |--------------------------------------------------------------------------
    | 应用程序语言环境
    |--------------------------------------------------------------------------
    |
    | 应用程序语言环境确定 Laravel 的翻译/本地化方法将使用的默认语言环境。
    | 您可以将此选项设置为计划拥有翻译字符串的任何语言环境。
    |
    */

    'locale' => env('APP_LOCALE', 'en'),

    'fallback_locale' => env('APP_FALLBACK_LOCALE', 'en'),

    'faker_locale' => env('APP_FAKER_LOCALE', 'en_US'),

    /*
    |--------------------------------------------------------------------------
    | 加密密钥
    |--------------------------------------------------------------------------
    |
    | Laravel 的加密服务使用此密钥，应将其设置为随机的 32 个字符的字符串，以确保所有加密值的安全性。
    | 您应该在部署应用程序之前执行此操作。
    |
    */

    'cipher' => 'AES-256-CBC',

    'key' => env('APP_KEY'),

    'previous_keys' => [
        ...array_filter(
            explode(',', env('APP_PREVIOUS_KEYS', ''))
        ),
    ],

    /*
    |--------------------------------------------------------------------------
    | 维护模式驱动
    |--------------------------------------------------------------------------
    |
    | 这些配置选项确定用于确定和管理 Laravel “维护模式” 状态的驱动程序。
    | “缓存” 驱动程序允许在多台机器上控制维护模式。
    | 支持的驱动程序："file", "cache"
    |
    */

    'maintenance' => [
        'driver' => env('APP_MAINTENANCE_DRIVER', 'file'),
        'store'  => env('APP_MAINTENANCE_STORE', 'database'),
    ],

];
